LuaVan/Luan_van/src/Documents/ProgramAmendment/ProgramAmendment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramAmendment</name>
  <posting>Allow</posting>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <registerRecords>InformationRegister.ApprovalLog</registerRecords>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>AmendmentType</name>
    <type>
      <types>EnumRef.AmendmentType</types>
    </type>
  </attributes>
  <attributes>
    <name>AmendmentSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EffectiveDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SupportingDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>ReviewYear</name>
    <type>
      <types>CatalogRef.AcademicYears</types>
    </type>
  </attributes>
  <attributes>
    <name>ReviewSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NewStatus</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
</mdclass:Document>

LuaVan/Luan_van/src/InformationRegisters/ProgramValidity/ProgramValidity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProgramValidity</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>Note</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>TrainingProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

LuaVan/Luan_van/src/Enums/AmendmentType/AmendmentType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AmendmentType</name>
  <enumValues>
    <name>MinorAmendment</name>
  </enumValues>
  <enumValues>
    <name>MajorAmendment</name>
  </enumValues>
  <enumValues>
    <name>Deactivation</name>
  </enumValues>
  <enumValues>
    <name>AnnualReview</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Enums/ProgramStatuses/ProgramStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProgramStatuses</name>
  <enumValues>
    <name>Draft</name>
  </enumValues>
  <enumValues>
    <name>UnderReview</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Issued</name>
  </enumValues>
  <enumValues>
    <name>Suspended</name>
  </enumValues>
  <enumValues>
    <name>Deactivated</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Documents/ProgramAmendment/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ProgramAmendment - Object Module
// - FillCheckProcessing: validate
//   + Deactivation/MajorAmendment → SupportingDecision bắt buộc
//   + AnnualReview → ReviewYear bắt buộc
// - Posting: ghi IR ProgramValidity + sync Catalog.Status
////////////////////////////////////////////////////////////////////////////////

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If TargetProgram.IsEmpty() Then
		ShowError("Vui lòng chọn CTĐT cần sửa đổi.", "TargetProgram", Cancel);
	EndIf;
	If (AmendmentType = Enums.AmendmentType.Deactivation
		Or AmendmentType = Enums.AmendmentType.MajorAmendment)
		And SupportingDecision.IsEmpty() Then
		ShowError("Sửa đổi lớn hoặc Ngừng hiệu lực phải có Quyết định căn cứ.", "SupportingDecision", Cancel);
	EndIf;
	If AmendmentType = Enums.AmendmentType.AnnualReview And ReviewYear.IsEmpty() Then
		ShowError("Vui lòng chọn năm học cần rà soát.", "ReviewYear", Cancel);
	EndIf;
EndProcedure

Procedure ShowError(Text, Field, Cancel)
	Msg = New UserMessage();
	Msg.Text = Text;
	Msg.Field = Field;
	Msg.Message();
	Cancel = True;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	ResolvedStatus = Status;
	If ResolvedStatus.IsEmpty() Then
		If AmendmentType = Enums.AmendmentType.Deactivation Then
			ResolvedStatus = Enums.ProgramStatuses.Deactivated;
		ElsIf AmendmentType = Enums.AmendmentType.MajorAmendment Then
			ResolvedStatus = Enums.ProgramStatuses.UnderReview;
		Else
			ResolvedStatus = Enums.ProgramStatuses.Issued;
		EndIf;
	EndIf;

	RegisterRecords.ProgramValidity.Write = True;
	Record = RegisterRecords.ProgramValidity.Add();
	Record.Period = ?(EffectiveDate = '00010101', Date, EffectiveDate);
	Record.TrainingProgram = TargetProgram;
	Record.Status = ResolvedStatus;
	If Not SupportingDecision.IsEmpty() Then
		Record.IssuanceDecision = SupportingDecision;
	EndIf;
	Record.Note = AmendmentSummary;

	UpdateProgramStatus(TargetProgram, ResolvedStatus);
EndProcedure

Procedure UpdateProgramStatus(ProgramRef, NewStatus)
	If ProgramRef.IsEmpty() Then
		Return;
	EndIf;
	ProgObj = ProgramRef.GetObject();
	If ProgObj <> Undefined Then
		ProgObj.Status = NewStatus;
		ProgObj.Write();
	EndIf;
EndProcedure
